{
    "Steps" : [
        {
        "ID" : "P",
        "Step" : "PREPARE",
        "Purpose" : "The purpose of the Prepare step is to carry out essential activities at the organization, mission and business process, and information system levels of the organization to help prepare the organization to manage its security and privacy risks using the Risk Management Framework.",
        "Publication" : {
            "ID" : "SP 800-37 Rev. 2"
        },
        "Tasks" : [{
            "ID" : "P-1",
            "Title" : "RISK MANAGEMENT ROLES",
            "Task" : "Identify and assign individuals to specific roles associated with security and privacy risk management.",
            "TaskTier" : "ORGANIZATION LEVEL",
            "TaskOutcomes": [
                "Individuals are identified and assigned key roles for executing the Risk Management Framework."
            ],
            "TaskPotentialInputs" : [
                "Organizational security and privacy policies and procedures",
                "Organizational charts"
            ],
            "TaskExpectedOutputs" : [
                "Documented Risk Management Framework role assignments."
            ],
            "PrimaryResponsibility" : {
                "Role" : {
                    "ID" : [
                        "Head of Agency", 
                        "Chief Information Officer" , 
                        "Senior Agency Official for Privacy"
                    ] 
                }
            },
            "SupportingRoles" : {
                "Role" : {
                    "ID" : [
                        "Authorizing Official", 
                        "Authorizing Official Designated Representative", 
                        "Senior Accountable Official for Risk Management",
                        "Risk Executive (Function)",
                        "Senior Agency Information Security Officer"
                    ]
                }
            },
            "Discussion" : "The roles and responsibilities of key participants in risk management processes are described in Appendix D. The roles and responsibilities may include personnel that are internal or external to the organization, as appropriate. Since organizations have different missions, functions, and organizational structures, there may be differences in naming conventions for risk management roles and how specific responsibilities are allocated among organizational personnel (e.g., multiple individuals filling a single role or one individual filling multiple roles). In either situation, the basic risk management functions remain the same. Organizations ensure that there are no conflicts of interest when assigning the same individual to multiple risk management roles. For example, authorizing officials cannot occupy the role of system owner or common control provider for systems or common controls they are authorizing. In addition, combining multiple roles for security and privacy requires care because the two disciplines may require different expertise, and in some circumstances, the priorities may be competing. Some roles may be allocated to a group or an office rather than to an individual, for example, control assessor, risk executive (function), or system administrator.",
            "References" : {
                "Publication" : {
                    "ID" : ["SP 800-160 v1", "SP 800-181", "NIST CSF"]
                }
            }
        },
        {
            "ID" : "P-2",
            "Title" : "RISK MANAGEMENT STRATEGY",
            "Task" : "Establish a risk management strategy for the organization that includes a determination of risk tolerance.",
            "TaskTier" : "ORGANIZATION LEVEL",
            "TaskOutcomes": [
                "A risk management strategy for the organization that includes a determination and expression of organizational risk tolerance is established."
            ],
            "TaskPotentialInputs" : [
                "Organizational mission statement",
                "Organizational policies",
                "Organizational risk assumptions, constraints, priorities and trade-offs"
            ],
            "TaskExpectedOutputs" : [
                "Risk management strategy and statement of risk tolerance inclusive of information security and privacy risk."
            ],
            "PrimaryResponsibility" : {
                "Role" : {
                    "ID" : [
                        "Head of Agency"
                    ] 
                }
            },
            "SupportingRoles" : {
                "Role" : {
                    "ID" : [
                        "Chief Information Officer", 
                        "Senior Accountable Official for Risk Management",
                        "Risk Executive (Function)",
                        "Senior Agency Information Security Officer",
                        "Senior Agency Official for Privacy"
                    ]
                }
            },
            "Discussion" : "Risk tolerance is the degree of risk or uncertainty that is acceptable to an organization. Risk tolerance affects all parts of the organization’s risk management process, having a direct impact on the risk management decisions made by senior leaders or executives throughout the organization and providing important constraints on those decisions. The risk management strategy guides and informs risk-based decisions including how security and privacy risk is framed, assessed, responded to, and monitored. The risk management strategy may be composed of a single document, or separate security and privacy risk management documents.54 The risk management strategy makes explicit the threats, assumptions, constraints, priorities, trade-offs, and risk tolerance used for making investment and operational decisions. This strategy includes the strategic-level decisions and considerations for how senior leaders and executives are to manage security and privacy risks (including supply chain risks) to organizational operations, organizational assets, individuals, other organizations, and the Nation. The risk management strategy includes an expression of organizational risk tolerance; acceptable risk assessment methodologies and risk response strategies; a process for consistently evaluating security and privacy risks organization-wide; and approaches for monitoring risk over time. As organizations define and implement the risk management strategies, policies, procedures, and processes, it is important that they include SCRM considerations. The risk management strategy for security and privacy connects security and privacy programs with the management control systems established in the organization’s Enterprise Risk Management strategy.",
            "References" : {
                "Publication" : {
                    "ID" : [
                        "SP 800-30",
                        "SP 800-39",
                        "SP 800-160 v1",
                        "SP 800-161",
                        "IR 8062",
                        "IR 8179",
                        "NIST CSF"
                        ]
                }
            }
        }]
    },
    {
        "ID" : "",
        "Step" : "",
        "Purpose" : "",
        "Publication" : {
            "ID" : ""
        },
        "Tasks" : [{
            "ID" : "",
            "Title" : "",
            "Task" : "",
            "TaskTier" : "",
            "TaskOutcomes": [
                ""
            ],
            "TaskPotentialInputs" : [
                ""
            ],
            "TaskExpectedOutputs" : [
                ""
            ],
            "PrimaryResponsibility" : {
                "Role" : {
                    "ID" : [
                        ""
                    ] 
                }
            },
            "SupportingRoles" : {
                "Role" : {
                    "ID" : [
                        ""
                    ]
                }
            },
            "Discussion" : "",
            "References" : {
                "Publication" : {
                    "ID" : [""]
                }
            }
        },
        {
            "ID" : "",
            "Title" : "",
            "Task" : "",
            "TaskTier" : "",
            "TaskOutcomes": [
                ""
            ],
            "TaskPotentialInputs" : [
                ""
            ],
            "TaskExpectedOutputs" : [
                ""
            ],
            "PrimaryResponsibility" : {
                "Role" : {
                    "ID" : [
                        ""
                    ] 
                }
            },
            "SupportingRoles" : {
                "Role" : {
                    "ID" : [
                        ""
                    ]
                }
            },
            "Discussion" : "",
                "References" : {
                "Publication" : {
                    "ID" : [""]
                }
            }
        }]
    }
]
}
